app/Controllers/usuario_controller.php

    public function formValidation() {
        $input = $this->validate([
       'nombre'   => 'required|min_length[3]',
       'apellido' => 'required|min_length[3]|max_length[25]',
       'usuario'  => 'required|min_length[3]',
       'email'    => 'required|min_length[4]|max_length[100]|valid_email|is_unique[usuarios.email]',
       'pass'     => 'required|min_length[3]|max_length[10]'],
        );
        $formModel = new usuario_Model();
        if (!$input){
            $data['titulo']='registro';
            echo view ('front/head_view',$data);
            echo view ('front/navbar_view');
            echo view ('back/usuario/registro', ['validation' => $this->validator]);
            echo view ('front/footer');
            }
            else {
                $formModel->save([
                    'nombre'=> $this->request->getVar('nombre'),
                    'apellido'=> $this->request->getVar('apellido'),
                    'usuario'=> $this->request->getVar('usuario'),
                    'email'=> $this->request->getVar('email'),
                    'pass'=> password_hash($this->request->getVar('pass'),PASSWORD_DEFAULT)

                ]);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`) VALUES ('amer', 'pereira', 'amer1', 'amer@gmail.com', '$2y$10$uZSFk2nKx4iieoxKSWZ6qu7VUJ6Tv5nghSKVvuF77kJ/emyMLbwRW')